dragon-dreamer/mcutl/mcutl/device/timer/stm32f1_timer.h
#pragma once

#include <limits>
#include <ratio>
#include <stdint.h>
#include <type_traits>

#include "mcutl/clock/clock.h"
#include "mcutl/device/device.h"
#include "mcutl/interrupt/interrupt.h"
#include "mcutl/memory/volatile_memory.h"
#include "mcutl/periph/periph.h"
#include "mcutl/timer/timer_defs.h"
#include "mcutl/utils/definitions.h"
#include "mcutl/utils/options_parser.h"
#include "mcutl/utils/type_helpers.h"

namespace mcutl::timer
{

namespace update_request_source
{

struct overflow_ug_bit_slave_controller {};
struct overflow {};

} //namespace update_request_source

template<bool Disable>
struct disable_update {};

struct trigger_registers_update {};

namespace master_mode
{

struct none {};
struct output_enable {};
struct output_update {};

} //namespace master_mode

namespace interrupt
{

using update = overflow;

} //namespace interrupt

namespace detail
{

struct prescaler_traits : prescaler_traits_base<types::limits<1, 65536>> {};

using reload_limits = types::limits<2, 65536>;

struct timer_frequency_traits_1_8_9_10_11
{
	template<typename ClockConfig>
	static constexpr auto get_timer_frequency() noexcept
	{
		return std::ratio<mcutl::clock::get_clock_info<ClockConfig,
			mcutl::device::clock::device_source_id::timer1_8_9_10_11>()
			.get_exact_frequency()>();
	}
};

struct timer_frequency_traits_2_3_4_5_6_7_12_13_14
{
	template<typename ClockConfig>
	static constexpr auto get_timer_frequency() noexcept
	{
		return std::ratio<mcutl::clock::get_clock_info<ClockConfig,
			mcutl::device::clock::device_source_id::timer2_3_4_5_6_7_12_13_14>()
			.get_exact_frequency()>();
	}
};

} //namespace detail

#ifdef RCC_APB1ENR_TIM2EN
using timer2 = detail::timer_base<2, uint16_t, 0xffffu, mcutl::periph::timer2,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer2, interrupt::update> : types::identity<mcutl::interrupt::type::tim2> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM2EN

#ifdef RCC_APB1ENR_TIM3EN
using timer3 = detail::timer_base<3, uint16_t, 0xffffu, mcutl::periph::timer3,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer3, interrupt::update> : types::identity<mcutl::interrupt::type::tim3> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM3EN

#ifdef RCC_APB1ENR_TIM4EN
using timer4 = detail::timer_base<4, uint16_t, 0xffffu, mcutl::periph::timer4,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer4, interrupt::update> : types::identity<mcutl::interrupt::type::tim4> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM4EN

#ifdef RCC_APB1ENR_TIM5EN
using timer5 = detail::timer_base<5, uint16_t, 0xffffu, mcutl::periph::timer5,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer5, interrupt::update> : types::identity<mcutl::interrupt::type::tim5> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM5EN

#ifdef RCC_APB1ENR_TIM6EN
using timer6 = detail::timer_base<6, uint16_t, 0xffffu, mcutl::periph::timer6,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer6, interrupt::update> : types::identity<mcutl::interrupt::type::tim6> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM6EN

#ifdef RCC_APB1ENR_TIM7EN
using timer7 = detail::timer_base<7, uint16_t, 0xffffu, mcutl::periph::timer7,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer7, interrupt::update> : types::identity<mcutl::interrupt::type::tim7> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM7EN

#ifdef RCC_APB1ENR_TIM12EN
using timer12 = detail::timer_base<12, uint16_t, 0xffffu, mcutl::periph::timer12,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer12, interrupt::update> : types::identity<mcutl::interrupt::type::tim8_brk_tim12> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM12EN

#ifdef RCC_APB1ENR_TIM13EN
using timer13 = detail::timer_base<13, uint16_t, 0xffffu, mcutl::periph::timer13,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer13, interrupt::update> : types::identity<mcutl::interrupt::type::tim8_up_tim13> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM13EN

#ifdef RCC_APB1ENR_TIM14EN
using timer14 = detail::timer_base<14, uint16_t, 0xffffu, mcutl::periph::timer14,
	detail::timer_frequency_traits_2_3_4_5_6_7_12_13_14,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer14, interrupt::update> : types::identity<mcutl::interrupt::type::tim8_trg_com_tim14> {};

} //namespace detail
#endif //RCC_APB1ENR_TIM14EN

#ifdef RCC_APB2ENR_TIM1EN
using timer1 = detail::timer_base<1, uint16_t, 0xffffu, mcutl::periph::timer1,
	detail::timer_frequency_traits_1_8_9_10_11,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

#if defined(STM32F103xG) || defined(STM32F101xG) //XL-density
template<>
struct interrupt_type_helper<timer1, interrupt::update> : types::identity<mcutl::interrupt::type::tim1_up_tim10> {};
#else //XL-density
template<>
struct interrupt_type_helper<timer1, interrupt::update> : types::identity<mcutl::interrupt::type::tim1_up> {};
#endif //XL-density

} //namespace detail
#endif //RCC_APB2ENR_TIM1EN

#ifdef RCC_APB2ENR_TIM8EN
using timer8 = detail::timer_base<8, uint16_t, 0xffffu, mcutl::periph::timer8,
	detail::timer_frequency_traits_1_8_9_10_11,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

