dragon-dreamer/mcutl/mcutl/device/timer/stm32f1_timer.h
#if defined(STM32F103xG) || defined(STM32F101xG) //XL-density
template<>
struct interrupt_type_helper<timer8, interrupt::update> : types::identity<mcutl::interrupt::type::tim8_up_tim13> {};
#else //XL-density
template<>
struct interrupt_type_helper<timer8, interrupt::update> : types::identity<mcutl::interrupt::type::tim8_up> {};
#endif //XL-density

} //namespace detail
#endif //RCC_APB2ENR_TIM8EN

#ifdef RCC_APB2ENR_TIM9EN
using timer9 = detail::timer_base<9, uint16_t, 0xffffu, mcutl::periph::timer9,
	detail::timer_frequency_traits_1_8_9_10_11,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer9, interrupt::update> : types::identity<mcutl::interrupt::type::tim1_brk_tim9> {};

} //namespace detail
#endif //RCC_APB2ENR_TIM9EN

#ifdef RCC_APB2ENR_TIM10EN
using timer10 = detail::timer_base<10, uint16_t, 0xffffu, mcutl::periph::timer10,
	detail::timer_frequency_traits_1_8_9_10_11,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer10, interrupt::update> : types::identity<mcutl::interrupt::type::tim1_up_tim10> {};

} //namespace detail
#endif //RCC_APB2ENR_TIM10EN

#ifdef RCC_APB2ENR_TIM11EN
using timer11 = detail::timer_base<11, uint16_t, 0xffffu, mcutl::periph::timer11,
	detail::timer_frequency_traits_1_8_9_10_11,
	detail::prescaler_traits, detail::reload_limits>;
namespace detail
{

template<>
struct interrupt_type_helper<timer11, interrupt::update> : types::identity<mcutl::interrupt::type::tim1_trg_com_tim11> {};

} //namespace detail
#endif //RCC_APB2ENR_TIM11EN

} //namespace mcutl::timer

namespace mcutl::device::timer
{

struct update_request_source
{
	enum value : uint8_t
	{
		overflow,
		overflow_ug_bit_slave_controller
	};
};

struct master_mode
{
	enum value : uint8_t
	{
		none,
		output_enable,
		output_update
	};
};

struct options : mcutl::timer::detail::options
{
	update_request_source::value update_request_source_type
		= update_request_source::overflow_ug_bit_slave_controller;
	bool disable_update = false;
	master_mode::value master = master_mode::none;
	
	uint32_t update_request_source_set_count = 0;
	uint32_t disable_update_set_count = 0;
	uint32_t trigger_registers_update_set_count = 0;
	uint32_t master_set_count = 0;
};

} // namespace mcutl::device::timer

namespace mcutl::timer::detail
{

template<typename Timer>
struct options_parser<Timer, update_request_source::overflow>
	: opts::base_option_parser<device::timer::update_request_source::overflow,
	&device::timer::options::update_request_source_type,
	&device::timer::options::update_request_source_set_count> {};
template<typename Timer>
struct options_parser<Timer, update_request_source::overflow_ug_bit_slave_controller>
	: opts::base_option_parser<device::timer::update_request_source::overflow_ug_bit_slave_controller,
	&device::timer::options::update_request_source_type,
	&device::timer::options::update_request_source_set_count> {};

template<typename Timer, bool Disable>
struct options_parser<Timer, disable_update<Disable>>
	: opts::base_option_parser<Disable,
	&device::timer::options::disable_update,
	&device::timer::options::disable_update_set_count> {};

template<typename Timer>
struct options_parser<Timer, trigger_registers_update>
	: opts::base_option_parser<0, nullptr,
	&device::timer::options::trigger_registers_update_set_count> {};

template<typename Timer>
struct options_parser<Timer, master_mode::none>
	: opts::base_option_parser<device::timer::master_mode::none,
	&device::timer::options::master,
	&device::timer::options::master_set_count> {};
template<typename Timer>
struct options_parser<Timer, master_mode::output_enable>
	: opts::base_option_parser<device::timer::master_mode::output_enable,
	&device::timer::options::master,
	&device::timer::options::master_set_count> {};
template<typename Timer>
struct options_parser<Timer, master_mode::output_update>
	: opts::base_option_parser<device::timer::master_mode::output_update,
	&device::timer::options::master,
	&device::timer::options::master_set_count> {};

} //namespace mcutl::timer::detail

namespace mcutl::device::timer
{

template<typename Timer>
constexpr uint32_t no_timer_assert() noexcept
{
	static_assert(types::always_false<Timer>::value, "Unsupported timer");
	return 0;
}

template<typename Timer>
constexpr uint32_t get_timer_register() noexcept
{
	if constexpr (false)
	{}
#ifdef TIM1_BASE
	else if constexpr (Timer::index == 1)
		return TIM1_BASE;
#endif //TIM1_BASE
#ifdef TIM2_BASE
	else if constexpr (Timer::index == 2)
		return TIM2_BASE;
#endif //TIM2_BASE
#ifdef TIM3_BASE
	else if constexpr (Timer::index == 3)
		return TIM3_BASE;
#endif //TIM3_BASE
#ifdef TIM4_BASE
	else if constexpr (Timer::index == 4)
		return TIM4_BASE;
#endif //TIM4_BASE
#ifdef TIM5_BASE
	else if constexpr (Timer::index == 5)
		return TIM5_BASE;
#endif //TIM5_BASE
#ifdef TIM6_BASE
	else if constexpr (Timer::index == 6)
		return TIM6_BASE;
#endif //TIM6_BASE
#ifdef TIM7_BASE
	else if constexpr (Timer::index == 7)
		return TIM7_BASE;
#endif //TIM7_BASE
#ifdef TIM8_BASE
	else if constexpr (Timer::index == 8)
		return TIM8_BASE;
#endif //TIM8_BASE
#ifdef TIM9_BASE
	else if constexpr (Timer::index == 9)
		return TIM9_BASE;
#endif //TIM9_BASE
#ifdef TIM10_BASE
	else if constexpr (Timer::index == 10)
		return TIM10_BASE;
#endif //TIM10_BASE
#ifdef TIM11_BASE
	else if constexpr (Timer::index == 11)
		return TIM11_BASE;
#endif //TIM11_BASE
#ifdef TIM12_BASE
	else if constexpr (Timer::index == 12)
		return TIM12_BASE;
#endif //TIM12
#ifdef TIM13_BASE
	else if constexpr (Timer::index == 13)
		return TIM13_BASE;
#endif //TIM13
#ifdef TIM14_BASE
	else if constexpr (Timer::index == 14)
		return TIM14_BASE;
#endif //TIM14_BASE
	else
		return no_timer_assert<Timer>();
}

template<typename Timer>
auto get_timer_count() MCUTL_NOEXCEPT
{
	constexpr auto timer_reg_base = get_timer_register<Timer>();
	return mcutl::memory::get_register_bits<&TIM_TypeDef::CNT, timer_reg_base>();
}

template<typename Timer>
void set_timer_count(uint16_t value) MCUTL_NOEXCEPT
{
	constexpr auto timer_reg_base = get_timer_register<Timer>();
	mcutl::memory::set_register_value<&TIM_TypeDef::CNT, timer_reg_base>(value);
}

template<typename Interrupt>
struct interrupt_flag
{
	static_assert(types::always_false<Interrupt>::value,
		"Unknown timer interrupt type");
};

template<>
struct interrupt_flag<mcutl::timer::interrupt::update>
{
	static constexpr uint32_t value = TIM_SR_UIF;
};

