dragon-dreamer/mcutl/mcutl/device/timer/stm32f1_timer.h
template<typename Timer, typename... Interrupts>
[[maybe_unused]] constexpr auto pending_flags_v = (0u | ... | interrupt_flag<Interrupts>::value);

template<typename Timer, typename... Interrupts>
void clear_pending_flags() MCUTL_NOEXCEPT
{
	constexpr uint32_t flags = pending_flags_v<Timer, Interrupts...>;
	if constexpr (flags != 0)
	{
		constexpr uint32_t all_flags
			= TIM_SR_CC4OF | TIM_SR_CC3OF | TIM_SR_CC2OF | TIM_SR_CC1OF
			| TIM_SR_TIF | TIM_SR_CC4IF | TIM_SR_CC3IF | TIM_SR_CC2IF | TIM_SR_CC1IF
			| TIM_SR_UIF;
		constexpr auto timer_reg_base = get_timer_register<Timer>();
		mcutl::memory::set_register_value<all_flags & ~flags,
			&TIM_TypeDef::SR, timer_reg_base>();
	}
}

template<typename Timer, typename... Interrupts>
inline void clear_pending_flags_atomic() MCUTL_NOEXCEPT
{
	clear_pending_flags<Timer, Interrupts...>();
}

template<typename Timer, typename... Interrupts>
uint32_t get_pending_flags() MCUTL_NOEXCEPT
{
	constexpr auto timer_reg_base = get_timer_register<Timer>();
	return mcutl::memory::get_register_bits<pending_flags_v<Timer, Interrupts...>,
		&TIM_TypeDef::SR, timer_reg_base>();
}

struct general_purpose_timer_registers
{
	uint32_t cr1 = 0;
	uint32_t cr2 = 0;
	uint32_t cr1_mask = 0;
	uint32_t cr2_mask = 0;
};

template<typename OptionsLambda>
constexpr general_purpose_timer_registers get_general_purpose_registers(
	OptionsLambda options_lambda) noexcept
{
	general_purpose_timer_registers result {};
	
	constexpr auto options = options_lambda();
	
	if constexpr (!!options.count_mode_set_count)
	{
		result.cr1_mask |= TIM_CR1_DIR_Msk;
		if constexpr (options.mode == mcutl::timer::detail::count_mode::count_down)
			result.cr1 |= TIM_CR1_DIR;
	}
	
	if constexpr (!!options.stop_on_overflow_set_count)
	{
		result.cr1_mask |= TIM_CR1_OPM_Msk;
		if constexpr (options.stop_on_overflow)
			result.cr1 |= TIM_CR1_OPM;
	}
	
	if constexpr (!!options.update_request_source_set_count)
	{
		result.cr1_mask |= TIM_CR1_URS_Msk;
		if constexpr (options.update_request_source_type == update_request_source::overflow)
			result.cr1 |= TIM_CR1_URS;
	}
	
	if constexpr (!!options.buffer_reload_value_set_count)
	{
		result.cr1_mask |= TIM_CR1_ARPE_Msk;
		if constexpr (options.buffer_reload_value)
			result.cr1 |= TIM_CR1_ARPE;
	}
	
	if constexpr (!!options.disable_update_set_count)
	{
		result.cr1_mask |= TIM_CR1_UDIS_Msk;
		if constexpr (options.disable_update)
			result.cr1 |= TIM_CR1_UDIS;
	}
	
	if constexpr (!!options.master_set_count)
	{
		result.cr2_mask |= TIM_CR2_MMS_Msk;
		if constexpr (options.master == master_mode::output_enable)
			result.cr2 |= TIM_CR2_MMS_0;
		else if constexpr (options.master == master_mode::output_update)
			result.cr2 |= TIM_CR2_MMS_1;
	}
	
	return result;
}

template<typename Timer, typename OptionsLambda>
void configure_general_purpose_timer(OptionsLambda options_lambda) MCUTL_NOEXCEPT
{
	constexpr auto options = options_lambda();
	constexpr auto registers = get_general_purpose_registers(options_lambda);
	constexpr auto timer_reg_base = get_timer_register<Timer>();
	
	if constexpr (!!options.enable_peripheral_set_count)
	{
		if constexpr (options.enable_peripheral)
		{
			mcutl::periph::configure_peripheral<
				mcutl::periph::enable<mcutl::timer::peripheral_type<Timer>>>();
		}
	}
	
	if constexpr (!options.base_configuration_set_count)
	{
		//This call also disables the timer in case it was enabled before
		mcutl::memory::set_register_value<registers.cr1, &TIM_TypeDef::CR1, timer_reg_base>();
		mcutl::memory::set_register_value<registers.cr2, &TIM_TypeDef::CR2, timer_reg_base>();
	}
	else
	{
		if constexpr (!!registers.cr1)
			mcutl::memory::set_register_value<registers.cr1, &TIM_TypeDef::CR1, timer_reg_base>();
		if constexpr (!!registers.cr2)
			mcutl::memory::set_register_value<registers.cr2, &TIM_TypeDef::CR2, timer_reg_base>();
	}
	
	if constexpr (options.prescaler_set_count && options.prescaler > 1u)
	{
		static_assert(options.prescaler != mcutl::timer::detail::unset_value);
		mcutl::memory::set_register_value<static_cast<uint32_t>(options.prescaler - 1),
			&TIM_TypeDef::PSC, timer_reg_base>();
	}
	else if (!options.base_configuration_set_count)
	{
		mcutl::memory::set_register_value<0u, &TIM_TypeDef::PSC, timer_reg_base>();
	}
	
	if constexpr (!!options.reload_value_set_count)
	{
		static_assert(options.reload_value != mcutl::timer::detail::unset_value);
		mcutl::memory::set_register_value<static_cast<uint32_t>(options.reload_value - 1),
			&TIM_TypeDef::ARR, timer_reg_base>();
	}
	else if (!options.base_configuration_set_count)
	{
		mcutl::memory::set_register_value<0xffffu, &TIM_TypeDef::ARR, timer_reg_base>();
	}
	
	if constexpr (!!options.trigger_registers_update_set_count)
		mcutl::memory::set_register_value<TIM_EGR_UG, &TIM_TypeDef::EGR, timer_reg_base>();
	
	if constexpr (options.overflow_set_count && !options.overflow.disable)
		mcutl::memory::set_register_value<TIM_DIER_UIE, &TIM_TypeDef::DIER, timer_reg_base>();
	else if (!options.base_configuration_set_count)
		mcutl::memory::set_register_value<0u, &TIM_TypeDef::DIER, timer_reg_base>();
	
	if constexpr (options.enable_controller_interrupts_set_count
		&& options.overflow_set_count && !options.overflow.disable)
	{
		mcutl::interrupt::enable<
			mcutl::interrupt::interrupt<
				mcutl::timer::interrupt_type<Timer, mcutl::timer::interrupt::overflow>,
				options.overflow.priority,
				options.overflow.subpriority
			>,
			options.priority_count_set_count ? options.priority_count : mcutl::interrupt::maximum_priorities
		>();
	}
	
	if constexpr (options.disable_controller_interrupts_set_count
		&& options.overflow_set_count && options.overflow.disable)
	{
		mcutl::interrupt::disable<
			mcutl::timer::interrupt_type<Timer, mcutl::timer::interrupt::overflow>
		>();
	}
	
	if constexpr (options.enable_set_count && options.enable)
	{
		mcutl::memory::set_register_value<registers.cr1 | TIM_CR1_CEN,
			&TIM_TypeDef::CR1, timer_reg_base>();
	}
	
	if constexpr (!!options.enable_peripheral_set_count)
	{
		if constexpr (!options.enable_peripheral)
		{
			static_assert(!options.enable, "Can not enable timer while disabling its peripheral");
			
			mcutl::periph::configure_peripheral<
				mcutl::periph::disable<mcutl::timer::peripheral_type<Timer>>>();
		}
	}
}

