dragon-dreamer/mcutl/mcutl/device/timer/stm32f1_timer.h
template<typename Timer, typename OptionsLambda>
void reconfigure_general_purpose_timer(OptionsLambda options_lambda) MCUTL_NOEXCEPT
{
	constexpr auto options = options_lambda();
	constexpr auto registers = get_general_purpose_registers(options_lambda);
	constexpr auto timer_reg_base = get_timer_register<Timer>();
	
	static_assert(!options.base_configuration_set_count,
		"base_configuration_is_currently_present makes no sense when used with timer reconfigure()");
	
	if constexpr (!!options.enable_peripheral_set_count)
	{
		if constexpr (options.enable_peripheral)
		{
			mcutl::periph::configure_peripheral<
				mcutl::periph::enable<mcutl::timer::peripheral_type<Timer>>>();
		}
	}
	
	[[maybe_unused]] uint32_t prev_cr1;
	if constexpr ((registers.cr1_mask & TIM_CR1_DIR) != 0)
	{
		prev_cr1 = mcutl::memory::get_register_bits<&TIM_TypeDef::CR1, timer_reg_base>();
		prev_cr1 &= ~registers.cr1_mask;
		prev_cr1 |= registers.cr1;
		mcutl::memory::set_register_value<&TIM_TypeDef::CR1, timer_reg_base>(prev_cr1 & ~TIM_CR1_CEN);
	}
	else
	{
		mcutl::memory::set_register_bits<registers.cr1_mask, registers.cr1,
			&TIM_TypeDef::CR1, timer_reg_base>();
	}
	
	mcutl::memory::set_register_bits<registers.cr2_mask, registers.cr2, &TIM_TypeDef::CR2, timer_reg_base>();
	
	if constexpr (!!options.prescaler_set_count)
	{
		static_assert(options.prescaler != mcutl::timer::detail::unset_value);
		mcutl::memory::set_register_value<static_cast<uint32_t>(options.prescaler - 1),
			&TIM_TypeDef::PSC, timer_reg_base>();
	}
	
	if constexpr (!!options.reload_value_set_count)
	{
		static_assert(options.reload_value != mcutl::timer::detail::unset_value);
		mcutl::memory::set_register_value<static_cast<uint32_t>(options.reload_value - 1),
			&TIM_TypeDef::ARR, timer_reg_base>();
	}
	
	if constexpr (!!options.trigger_registers_update_set_count)
		mcutl::memory::set_register_value<TIM_EGR_UG, &TIM_TypeDef::EGR, timer_reg_base>();
	
	[[maybe_unused]] uint32_t dier;
	if constexpr (options.overflow_set_count
		|| options.enable_controller_interrupts_set_count
		|| options.disable_controller_interrupts_set_count)
	{
		dier = mcutl::memory::get_register_bits<&TIM_TypeDef::DIER, timer_reg_base>();
		if constexpr (!!options.overflow_set_count)
		{
			dier &= ~TIM_DIER_UIE_Msk;
			if constexpr (!options.overflow.disable)
				dier |= TIM_DIER_UIE;
			
			mcutl::memory::set_register_value<&TIM_TypeDef::DIER, timer_reg_base>(dier);
		}
	}
	
	if constexpr (!!options.enable_controller_interrupts_set_count)
	{
		if (dier & TIM_DIER_UIE)
		{
			mcutl::interrupt::enable<
				mcutl::interrupt::interrupt<
					mcutl::timer::interrupt_type<Timer, mcutl::timer::interrupt::overflow>,
					options.overflow.priority,
					options.overflow.subpriority
				>,
				options.priority_count_set_count ? options.priority_count : mcutl::interrupt::maximum_priorities
			>();
		}
	}
	
	if constexpr (!!options.disable_controller_interrupts_set_count)
	{
		if (!(dier & TIM_DIER_UIE))
		{
			mcutl::interrupt::disable<
				mcutl::timer::interrupt_type<Timer, mcutl::timer::interrupt::overflow>
			>();
		}
	}
	
	if constexpr (!!options.enable_set_count)
	{
		if constexpr (options.enable)
		{
			mcutl::memory::set_register_bits<TIM_CR1_CEN_Msk, TIM_CR1_CEN,
				&TIM_TypeDef::CR1, timer_reg_base>();
		}
		else
		{
			mcutl::memory::set_register_bits<TIM_CR1_CEN_Msk, ~TIM_CR1_CEN,
				&TIM_TypeDef::CR1, timer_reg_base>();
		}
	}
	else if constexpr ((registers.cr1_mask & TIM_CR1_DIR) != 0)
	{
		if (prev_cr1 & TIM_CR1_CEN)
			mcutl::memory::set_register_value<&TIM_TypeDef::CR1, timer_reg_base>(prev_cr1);
	}
	
	if constexpr (!!options.enable_peripheral_set_count)
	{
		if constexpr (!options.enable_peripheral)
		{
			static_assert(!options.enable, "Can not enable timer while disabling its peripheral");
			
			mcutl::periph::configure_peripheral<
				mcutl::periph::disable<mcutl::timer::peripheral_type<Timer>>>();
		}
	}
}

template<typename Timer, typename OptionsLambda>
void configure(OptionsLambda options_lambda) MCUTL_NOEXCEPT
{
	if constexpr (Timer::index >= 2 && Timer::index <= 5)
		configure_general_purpose_timer<Timer>(options_lambda);
	
	static_assert(Timer::index >= 2 && Timer::index <= 5,
		"Selected timer is not supported");
}

template<typename Timer, typename OptionsLambda>
void reconfigure(OptionsLambda options_lambda) MCUTL_NOEXCEPT
{
	if constexpr (Timer::index >= 2 && Timer::index <= 5)
		reconfigure_general_purpose_timer<Timer>(options_lambda);
	
	static_assert(Timer::index >= 2 && Timer::index <= 5,
		"Selected timer is not supported");
}

template<typename Timer>
[[maybe_unused]] constexpr bool supports_stop_on_overflow = true;
template<typename Timer>
[[maybe_unused]] constexpr bool supports_prescalers = true;
template<typename Timer>
[[maybe_unused]] constexpr bool supports_reload_value = true;
template<typename Timer>
[[maybe_unused]] constexpr bool supports_reload_value_buffer = true;
template<typename Timer>
[[maybe_unused]] constexpr auto default_count_direction = mcutl::timer::count_direction::up;
template<typename Timer>
[[maybe_unused]] constexpr bool supports_atomic_clear_pending_flags = true;
template<typename Timer>
[[maybe_unused]] constexpr uint32_t default_reload_value = 0xffffu + 1u;

} //namespace mcutl::device::timer
